[
  {
    "id": "e2fb33f59c3645e39f9338b8c2e9b8d5",
    "heading": "Riding the tariff relief rally",
    "tokens": 165,
    "text": "We raise global equities to Ov US trade policy risks have eased, and market technical indicators have improved. More trade deals and relative resilience in economic activity data and corporate earnings estimates are key to sustaining the rally.  \nUpgrade US equities to a small Overweight. The ‘Sell America’ trade is overdone. However, we will continue to diversify across major regions. We are Overweight China within Asia ex-Japan, given policy stimulus and a softer USD.  \nDowngrade gold to a core holding, as we expect a period of consolidation ahead. High-quality bonds remain attractive” at today’s elevated yields.  \nWhat next after the relief rally?  \nWhat are the key macro scenarios to consider?  \nAre quantitative models still bullish on equities?  \nImportant disclosures can be found in the Disclosures Appendix."
  },
  {
    "id": "fd05c145f474407688c8e9bde06677c2",
    "heading": "Riding the tariff relief rally",
    "tokens": 60,
    "text": "12m Foundation Overweights:  \n* Equities  \n¢ We raise global equities to Overweight. US trade policy risks have eased, and market technical indicators have improved. More trade deals and relative resilience in economic activity data and corporate earnings are key to sustaining the rally.  \n* US equities"
  },
  {
    "id": "074c1c9b4ca24d8b982d82afb74edbff",
    "heading": "Opportunistic ideas — Equities",
    "tokens": 114,
    "text": "¢« Upgrade US equities to a small Overweight. The ‘Sell America’ trade is overdone. However, we will continue to diversify across major regions. We are Overweight China within Asia ex-Japan, given policy stimulus and a softer USD.  \n* US software, communications, major banks, semiconductors  \n* Downgrade gold to a core holding, as we expect a period of consolidation ahead. High-quality bonds remain attractive at today’s elevated yields.  \n* China non-financial high- dividend SOEs and Hang Seng Technology index"
  },
  {
    "id": "b17c32d541154122b5c2a10e39a350d4",
    "heading": "Opportunistic ideas — Bonds",
    "tokens": 350,
    "text": "* US Agency mortgage-backed securities (MBS)  \nUS trade policy has undergone three major changes over the past two months. ‘Liberation Day’ (2 April) brought higher-than-expected tariffs. Subsequently, on 9 April, Trump paused most tariffs for 90 days to focus on trade talks. More recently, the US announced the outline of a ‘deal’ with the UK and start of US-China trade talks. Markets have followed this flip-flop, with the S&P500 falling about 20% peak-to-trough at one point, before recovering most of the losses and turning positive year-to-date.  \n* UK Gilts (FX unhedged)  \n+ US 20-year-plus government bonds  \n* US Treasury Inflation-Protected Securities (TIPS)  \nThe most important question today is whether the equity rebound has legs in the long term or whether we see a renewed relapse in the near term. To help answer this, we focus on two key upcoming event risks.  \nFirst is trade policy. We expect more trade deal conclusions sustaining the rally — especially with the 90-day tariff pause ending in early July. Second is economic data. We expect relative resilience in hard data (i.e., real economic activity) to sustain market gains, despite the recent weakness in soft sentiment data from surveys. Progress on Trump's deregulation agenda should also offer support.  \nAs a base case, we still expect the US economy to achieve a benign soft landing, with growth slowing below trend. However, a hard landing remains a risk. The latest US sovereign rating downgrade highlights ongoing concerns about US fiscal deficits, though we would view a significant impact on bond markets as more of a tail risk.  \nGlobal Market Outlook"
  },
  {
    "id": "c122e6a54a714a78a2723ffd0755fee0",
    "heading": "Overweight equities, for now",
    "tokens": 307,
    "text": "Given the risks, it is fair to question why we are upgrading equities back to an Overweight.  \nA sharp improvement in the near-term outlook drives our more constructive view on global equities. Our short-term (one- to three-month) technical models have turned bullish for US and China equities. This means a test, or a break above, the S&P500’s prior record high can be expected. Our longer-term stock-bond model has also turned modestly bullish on global equities, but this is also driven by technical (rather than fundamental) drivers. The reasonably long period between now and early July (when the US 90-day tariff pause ends) creates room for equity momentum to run further, especially if a few more trade deals are signed and Trump is able to implement his deregulation and tax agendas.  \nRegionally, we have a slight preference for US equities. The Q1 earnings season was strong, and the ‘Sell America’ trade was arguably excessive, given resilient earnings.  \nHaving said that, we continue to emphasise the importance of ensuring adequate diversification across regions. We view Euro area and Asia ex-Japan equities as core holdings, with pullbacks as opportunities to rebalance. Within Asia ex-Japan, we are Overweight Chinese equities, given the additional support from domestic stimulus. We retain Indian equities as a core holding, given a possible US-India trade deal, strong earnings growth and foreign investor inflows. Both markets should benefit from a weaker USD."
  },
  {
    "id": "5ea012f9dcda480383a55358d2fdb5f0",
    "heading": "Gold to consolidate near term",
    "tokens": 113,
    "text": "We reduce gold to a core holding and expect prices to approach USD 3,100/oz over the next one to three months. After the surge in prices this year, we see a period of consolidation before the next leg higher. This is a pattern witnessed several times since 2022 and illustrates major buyers display a degree of price sensitivity in the current environment. Over a longer-term, 6-12-month horizon, we expect gold to make a renewed move _ towards USD 3,500/oz as major central bank buying resumes.  \nGlobal Market Outlook"
  },
  {
    "id": "4e108cde1d734041b76e72d3ac08b240",
    "heading": "Add to high-quality bonds",
    "tokens": 187,
    "text": "US government bond yields have rebounded following the rebound in risk appetite and Moody's credit rating downgrade.  \nWe view bonds as a core holding and believe it is attractive to buy high-quality bonds at current yields. Short of an unexpected inflation shock, the US 10-year government bond yield is expected to fall (i) to the 4.00-4.25% range in our base soft-landing scenario and (ii) below 4% in a hard-landing scenario. A jump in yields on the back of US fiscal deficit concerns is a key risk, highlighted by the US credit rating downgrade. However, studies of sovereign credit stress over the last few centuries argue debt imbalances can persist for long periods. This argues the case for viewing this as more of a tail risk in the absence of a trigger.  \nWe now see attractive value in longer maturity bonds, which offer exposure to an expected move lower in yields."
  },
  {
    "id": "1c281f4de3554fd7a8850ac92334d061",
    "heading": "US dollar — higher then lower",
    "tokens": 108,
    "text": "We expect the US Dollar index (DXY) to rebound over the next 1-3 months and then weaken over 6-12 months.  \nIn the near term, renewed appetite for US assets and closing of earlier bearish positions should offer support for the USD. This should reduce demand for safe haven currencies, typically with low borrowing costs. However, we expect this USD bounce to be temporary. Ongoing rotation out of US assets and elevated USD valuations are likely to lead toa modestly weaker USD in the longer term."
  },
  {
    "id": "8439e651cb964e0699c56c3e5dac1c33",
    "heading": "Opportunistic ideas",
    "tokens": 69,
    "text": "Within equities, we opportunistically turn bullish on US-listed semiconductor sector equities, which we expect to benefit from the ongoing rally in US cyclical sectors. Within bonds, we also opportunistically turn bullish on (i) 20-year-plus US government bonds and (ii) UK government bonds (FX- unhedged)."
  },
  {
    "id": "aab9a770673a4b17963fcf91a83f3094",
    "heading": "Foundation asset allocation models",
    "tokens": 68,
    "text": "The Foundation and Foundationt+ models are allocations that you can use as the starting point for building a diversified investment portfolio. The Foundation model showcases a set of allocations focusing on traditional asset classes that are accessible to most investors, while the Foundation+ model includes allocations to private assets that may be accessible to investors in some jurisdictions, but not others."
  },
  {
    "id": "8d70bb52695e4738b65654b802f2e0ef",
    "heading": "2 What’s next after the relief rally?",
    "tokens": 262,
    "text": "The US-China trade truce supports a constructive stance on risk  \nHowever, uncertainties remain — we outline three key scenarios  \nDiversification remains crucial to navigate the uncertainties ahead  \nMarket dynamics have shifted notably in recent weeks. Trade tensions that once weighed on sentiment have eased considerably, paving the way for a sharp rebound in US equities. The US administration has demonstrated pragmatism, with an apparent desire to avoid economic self-harm. Combined with resilient macro data and solid corporate earnings, these developments have narrowed the range of potential outcomes for risk assets, reducing the likelihood of a sharp drawdown in equities.  \nThe US-China truce on trade has reduced the risks of a US economic hard- landing and supports a more constructive stance on risk. However, the road ahead will be bumpy, requiring careful navigation by investors. A divergence between ‘hard’ and ‘soft’ economic data has emerged — hard economic data remains resilient, while soft survey data signals fragility, raising the risk that hard data may eventually weaken. Risk assets have also priced in much of the recent optimism, and with US equity valuations again elevated, further gains will hinge on meaningful progress on trade negotiations and Trump's proposed ‘Big Beautiful (tax cut) Bill’, which we expect to dominate the market narrative in the coming months."
  },
  {
    "id": "6071bed5ee994af98599881dd97977d4",
    "heading": "Mapping the path ahead",
    "tokens": 74,
    "text": "To help investors navigate the uncertainties ahead, we outline three potential scenarios shaped by developments in trade and fiscal policy. Our core scenario is that the US will ultimately be able to achieve a soft-landing, but not without navigating significant volatility and challenges along the way. Trade talks are still in their early stages, while the budget bill raises the risk of delays and policy uncertainty."
  },
  {
    "id": "dbaac0c85e8142bba318150e69a97258",
    "heading": "Fig.8 US ‘hard’ data has been resilient, but weakening ‘soft’ data signals underlying fragility",
    "tokens": 149,
    "text": "US ‘soft’ vs ‘hard’ data  \ndownside is limited by rising inflation and term premia, even as the Fed cuts rates. Only short-dated government bonds, safe-haven currencies and gold offer refuge.  \nNo landing: US equities and riskier bonds to outperform  \nUS equities and riskier bonds outperform, putting to rest the ‘Sell America’ narrative. The S&P 500 rises to 7,000 over a 12-month period, gaining 20% from current levels. Foreign demand returns for US government bonds, but better risk sentiment, limited pressure for the Fed to act, and lingering deficit concerns keep 10-year yields within the 4.5-5.0% range."
  },
  {
    "id": "580d5270225848ddbde3966f53212a23",
    "heading": "Soft landing: our core scenario",
    "tokens": 210,
    "text": "In this scenario, Trump struggles politically, with policy gridlock stalling progress on his agenda, contributing to prolonged uncertainty. However, trade negotiations do yield results, while a scaled-down version of the tax bill eventually passes Congress. Crucially, US growth slows but escapes a recession as the Fed cuts rates from H2. Market volatility is likely to persist in the near-term, particularly as key deadlines for Trump’s 90-day pause on reciprocal tariffs and the proposed tax bill converge in July. But investors who remain patient would be rewarded as resilient earnings underpin gains in the S&P 500. Our 12-month target for the S&P 500 is at 6,520, 12% higher from current levels.  \nHard landing: short-dated bonds and gold preferred This scenario is the least conducive for US growth and risk assets. The S&P 500 revisits year-to-date lows, before falling further to around 4,500 as hard economic data deteriorates. The US 10-year bond yield falls below 4%, but"
  },
  {
    "id": "092e15900fdf49ca9c96e8f8285d94ba",
    "heading": "Diversification remains crucial to navigate uncertainties",
    "tokens": 98,
    "text": "The complex outlook calls for tempered optimism. In this nuanced backdrop, diversification remains crucial. While the S&P500 has eked out gains for the year, other regions and sectors, such as European equities and the Chinese technology sector, have outperformed. Our strategies have also delivered lower drawdowns compared to traditional 60/40 portfolios and global equities. This underscores the value of active diversification — not just across asset classes but across geographies and strategies as well."
  },
  {
    "id": "a021b5d6ee3342c6a00bc2cb69fd1952",
    "heading": "Our view",
    "tokens": 284,
    "text": "Core scenario (soft landing, 50% probability): The US-China trade truce has reduced the chance of a US economic hard landing. Although still-elevated tariffs will slow growth and lift inflation, the focus will move to trade deals, tax cuts and deregulation. We expect the resulting improvement in consumer and business sentiment to help the US avert a recession. As the job market cools, we expect the Fed to cut rates by 75bps over the next 12 months, starting from H2. Meanwhile, fiscal and monetary policy easing in China and Europe (especially Germany) should broaden growth beyond the US.  \nDownside risk (hard landing, 25% probability): Depressed US consumer and business sentiment, worsened by renewed trade tensions, could hurt real activity data. Even if the Fed hastens rate cuts, the US could experience a mild recession, dragging global growth. A surge in US bond yields due to unfunded tax cuts and a USD sell-off is another risk to the soft-landing view.  \nUpside risk (no-landing, 25% probability): Cuts to US government spending and taxes and deregulation could revive private sector ‘animal spirits’. Meanwhile, the US could use tariff pressure to finalise trade deals and seal a ‘grand bargain’ with China, boosting domestic consumption in China and investment in Europe. This could lead to a more balanced global economy."
  },
  {
    "id": "41b14c46c98c4489aae56cb6faa91a0e",
    "heading": "Key chart",
    "tokens": 41,
    "text": "The US-China temporary tariff truce has eased global trade uncertainty. However, investors’ focus will turn to incoming ‘hard’ data to see if US policies have further damaged the already softening labour market."
  },
  {
    "id": "6a597bff289942eea5f1152f7a768887",
    "heading": "Macro factors to watch",
    "tokens": 481,
    "text": "US trade deals, tax cuts and deregulation: The US-China truce and the preliminary US-UK trade deal set the tone for US talks with key partners. The UK deal suggests a 10% baseline tariff will apply to all US imports, which partly pays for proposed tax cuts. China will face a higher tariff than the baseline but not as high as 50-60% initially feared. Strategic sectors, such as steel, aluminium, autos and semiconductors, will face restrictive (higher-than-baseline) tariffs.  \nGerman fiscal boost, trade thaw to limit ECB rate cuts: Europe’s economic revival significantly rests on how soon the new German government implements its 12-year, EUR 500bn infrastructure spending plan (equivalent to 1% of GDP per year) and off-budget defence spending that were recently approved by the parliament. Euro area PMI data showed service sector (70% of the economy) slowed in May. However, Germany's fiscal spending plan and a US trade deal would reduce the chances of ECB rate cuts. We expect one more 25bps ECB deposit rate cut in June, followed by a long pause.  \nEven after the US-China temporary tariff rollbacks and likely consumption shifts, the US average tariff rate will be 16.4%, the highest since 1937, according to the Yale Budget Lab. This is estimated to cut US growth by 0.7% and lift inflation by 1.7% in the short term. Hence, there is an urgency for the administration to enact tax cuts and deregulation in the coming months. We expect a modest net fiscal stimulus from the tax cuts due to pressure from the bond markets. A weaker job market will allow the Fed to start cutting rates in H2  \nscenario of an all-out trade war. It also underlined the so- called ‘Trump put’ remains in place — that US trade policy is likely to be restrained by markets. However, China continues to face deflationary pressures, and still-elevated US tariffs are _[Kely to continue to weigh on growth and prices. Hence, we expect Beijing to keep easing monetary and fiscal policies, including further bank deposit rate cuts, to help achieve its c.5% growth target for this year. US-China trade talks, stimulus: The US-China temporary trade truce has arguably removed the worst-case  \nGlobal Market Outlook"
  },
  {
    "id": "ac27e9367d674054b514d6c0813d3354",
    "heading": "Our view",
    "tokens": 212,
    "text": "Foundation: We downgrade DM government bonds to a core holding but still believe current yield levels offer an attractive entry point. Worries about inflation and the US fiscal deficit have pushed yields higher, but we expect yields to eventually fall in both soft and hard landing scenarios. An unexpected surge in inflation expectations due to tariffs is the key risk.  \nNew opportunistic view: Turn bullish US 20-year-plus US government bonds. We believe the recent rise in 20-year+ US bond yields to the upper end of their recent trading range makes them attractive. A surge in inflation expectations is a risk.  \nNew opportunistic view: Turn bullish UK government bonds [Gilts] (FX-unhedged). We like the nominal yield pick-up over other Developed Market (DM) government bonds and believe the Bank of England is in a better position to cut rates relative to peers. Risks include stronger-than-expected inflation, wage growth and significant GBP weakness.  \nOutstanding opportunistic views: Bullish US Agency MBS; bullish US Treasury Inflation-Protected Securities."
  },
  {
    "id": "03187afad02f4661b5ecf6270d4bfc8b",
    "heading": "Fig. 12. Major DM central banks remain dovish; Global bond yield premia have partly reversed the March-April widening episode",
    "tokens": 425,
    "text": "Money market expectations of rate cuts; Global bond yield premia  \nWe continue to view global bonds as a core holding. In our base soft landing scenario, we expect bond returns to be supported by falling yields from current levels, helping them outperform cash which does not offer protection against lower central bank interest rates. High quality bonds should also offer diversification benefits (in a low or falling inflation outcome) particularly in a hard landing risk scenario.  \nWe downgrade DM Investment Grade (IG) government bonds to a core holding (Neutral) amid fiscal and_ inflation uncertainty. We still believe major DM central banks have room to cut policy rates where growth data is slowing, which should offer support to the sub-asset class and help yields move lower once current US tax and spending worries abate.  \nCurrent nominal bond yields are near the upper end of their recent range, making the risk/reward profile attractive, especially for high-quality bonds. Looking ahead, we anticipate investor focus will gradually shift from concerns over fiscal imbalances to the broader economic growth outcome. High-quality bonds can serve as a hedge against the prevailing uncertainty. Risks to our view include reduced rate cut expectations and a surge in the US deficit.  \nWe now view both Emerging Market (EM) USD government bonds and EM local currency government bonds as core holdings. Both should benefit from a softer USD over the next 6-12 months, given that a weaker USD has historically been a positive for fund flows into EM assets.  \nDM IG and High Yield corporate bonds remain core holdings. While yield premia have tightened from their recent peak, technical drivers remain supportive as we anticipate solid fund inflows, especially to capture today’s yield levels.  \nThat said, while nominal corporate/EM bond yields are also higher, credit spreads (premium over government bond yields) appear to be tight again after falling to their one-year average.  \nWe also view Asia USD bonds as a core holding. Although most Asian economies face a risk from US tariffs, stronger external balances, flexible monetary policy tools and robust domestic support are expected to cap any move higher in yields.  \nGlobal Market Outlook"
  },
  {
    "id": "1640b541c4274c86a2fd9a8fc9a03638",
    "heading": "Our view",
    "tokens": 87,
    "text": "We upgrade Global and US equities to Overweight as trade tensions de-escalate and there is further room for investor positioning to normalise.  \nWe plan to increase exposure to US equities on near-term pullback, especially on growth-focused US equities, while rotating out of defensively tilted UK equities.  \nWe expect China equities to outperform Asia ex-Japan, with attractive valuation and growth prospects from DeepSeek."
  },
  {
    "id": "2568dd001ff644e28a6392617a54f0db",
    "heading": "Tailwind from the ‘clarity factor’",
    "tokens": 468,
    "text": "We upgrade global equities to Overweight versus other asset classes. Fading tariff concerns and still-robust economic data are bolstering investor sentiment.  \nWithin global equities, we upgrade US equities to Overweight. Q1 25 earnings beat expectations, with relatively resilient forward earnings guidance. The US-China temporary tariff rollback has reduced uncertainty on the earnings outlook and we expect further de-escalation in trade talks to support earnings projections. Elevated ROE justifies elevated US valuations (12m forward P/E at 19.5% premium to global stocks). Investor positioning in US equities has risen from extreme lows but there is still has scope for further upside.  \nWe downgrade UK equities to Underweight. UK equities are heavy on defensive sectors, which go against our ‘pro-risk’ stance. We see positives from the UK’s trade deal with the US to be largely priced in following its strong rally since the ‘Liberation Day’.  \nWe view Asia ex-Japan as a core holding. A weaker USD and de-escalation of tension between the US and China are  \npositives, but earnings revisions are poor. Within Asia ex- Japan, we are Overweight China equities. Domestic policies are supportive, such as easing monetary policy and fiscal support on technological innovations. Such policies should lend more tailwind to China onshore equities. However, China offshore equities have more attractive technology sector exposure. Hence, we move to a Neutral preference between onshore versus offshore China equities. India equities remain a core holding within Asia ex-Japan. India is relatively insulated from tariff concerns, but its 2025 earnings expectations are declining, and valuations are elevated.  \nEurope ex-UK equities remain a core holding. They benefit from rising fiscal and defence spending as well as further easing from the ECB. However, earnings growth projections for 2025 have moderated significantly since start of year and are likely to decline further should geopolitical tensions intensify.  \nJapan equities remain a core holding. The catalyst of improving corporate governance, e.g. share buybacks, remains; Nippon Individual Savings Account (NISA) programme continues to drive fund inflows. The stronger JPY and potential uncertainties from Japan's general election in July act as headwinds.  \nGlobal Market Outlook"
  },
  {
    "id": "b216e554d9464a0cbce87ce87d6d5164",
    "heading": "Turning bullish on semiconductors",
    "tokens": 334,
    "text": "* US-listed semiconductors are our newest opportunistic idea. The thaw between the US and China brings ‘clarity’ to risk assets, reducing uncertainty for investors. Investors once again are able to refocus on the artificial intelligence (Al) trend, particularly the demand for semiconductors from higher-end Al.  \n¢ Within the US, we continue to prefer sectors with strong pricing power (technology software, communication services) or are likely beneficiaries of an economic soft- landing and deregulation (financials).  \n* Outside the US, we continue to prefer sectors with domestic exposure (Europe banks and China non- financial high-dividend SOEs) or those having an offsetting stimulus (Europe industrials and Hang Seng technology).  \nUS-listed semiconductors (new): Guidance from the Q1 earnings season points to continued growth in Al spending. Markets have ‘graduated’ from concerns about lower computational demand from ‘low-cost’ Al models such as DeepSeek, to how such models help expand the size of the ‘Al pie’. Lower-than-expected Al spending is a risk.  \ndefence, electrical equipment and machinery companies. A downturn in Europe’s economy is a risk.  \nChina’ non-financial high-dividend SOEs: Their predominantly domestic exposure means they will benefit from the government’s stimulus. Non-financial SOEs are less exposed to the troubled property sector. Adverse regulatory changes are a risk.  \nHang Seng technology: Policymakers’ support for Al and technology development underpin the growth outlook. They are cheap versus their counterparts in the US. Weaker-than- expected stimulus is a risk."
  },
  {
    "id": "3b739da22caa44a2ad1e72a7b056e459",
    "heading": "Sector views: Turning pro-growth",
    "tokens": 69,
    "text": "We turn pro-growth in the US, downgrading the defensive healthcare and utilities sectors to Neutral and staying Overweight on financials, communication and technology. In Europe, we upgrade consumer discretionary to Neutral and downgrade staples to Underweight. In China, we maintain exposure to improving consumption and Al adoption with our preference for technology, communication and discretionary."
  },
  {
    "id": "75899c1ffabb4d3ca34082f3bab984ff",
    "heading": "Our sector views by region",
    "tokens": 186,
    "text": "US technology software: The software industry has been relatively resilient against tariffs, helped by its strong pricing power. A decline in the cost of Al tools supports software products and development. Weakness in corporate IT spending is a risk.  \nUS communication services: Attractive growth continues with online entertainment and Al applications. Digital advertising may slow along with the tariffs, but this has been priced in. Advertising softness is a risk.  \nUS major banks: They benefit from a soft landing in the US economy and deregulation, with potentially greater share buybacks. A sharp slowdown in the US economy is a risk.  \nEurope banks: They derive two-thirds of revenue from Europe and will benefit from Germany's fiscal stimulus. Attractive dividends and share buybacks are supportive factors. A sharp slowdown in Europe’s economy is a risk.  \nEurope industrials: Europe’s plans to boost infrastructure and defence spending would support aerospace and  \nGlobal Market Outlook"
  },
  {
    "id": "756f90df831f47e7be038f19c4f39533",
    "heading": "Our view",
    "tokens": 205,
    "text": "We expect the USD to rebound in the near term before retreating over the next 12 months. Tariff de-escalation can take the USD Index (DXY) to 103 over the next 1-3 months, but concerns about US assets are likely to weigh in the longer term.  \nEUR/USD faces downside risk in the near-term but we would accumulate on dips. We expect the EUR/USD to ease back to 1.08 over the next three months, mirroring the near-term USD rebound. However, the improving growth outlook in Germany and narrowing rate differentials can take EUR/USD to 1.14 in 12 months.  \nAsian currencies likely rangebound. Our expectations for USD/SGD are perhaps most representative of our view on Asian currencies — we expect the pair to ease to 1.32 over the next three months before edging higher to 1.34 in 12 months as Asian central bank policy easing helps lean against recent appreciation pressure on their currencies."
  },
  {
    "id": "e236a7a08ede43b3a894d48d7726ca6b",
    "heading": "Key chart",
    "tokens": 51,
    "text": "Recent USD weakness has mainly been against G7 currencies. The USD nominal» effective exchange rate (NEER) is stil above its long- term average.  \nFig. 15 GBP and USD valuations remain above their five-year average; FX forecast table"
  },
  {
    "id": "ccb6577e37274ec393da201423c1bfa2",
    "heading": "Clouds over the USD over the longer-term",
    "tokens": 255,
    "text": "The USD index (DXY) has fallen 8% year to date, weighed by trade uncertainty, widening fiscal deficits and waning investor confidence in US policies. US tariffs and the recent US credit rating downgrade have prompted investors to retreat from US assets. Ongoing trade negotiations and peaking tariff stress support a near-term rebound, but the US’ rising government debt continues to weigh on the USD. In Europe, markets have priced in an ECB rate cut in June. ECB Governing Council members view current interest rates as sufficiently low and see less need for significantly more easing. We expect the EUR/USD to rebound in H2 25 and trade at 1.14 in 12 months, riding on a growth recovery in Germany and narrowing rate differentials. We see GBP/USD trading around 1.31 in the near term and rise towards 1.34 over 6-12 months. Meanwhile, easing global trade tensions and fading risk aversion should support near-term upside in USD/JPY and USD/CHF. In particular, the trade-weighted CHF reached a record high in April, prompting market speculation about potential SNB intervention to weaken the currency. We see the possibility of negative Swiss interest rates by September. Commodity currencies are expected"
  },
  {
    "id": "dec6db14b92e4a67987ea532855d4670",
    "heading": "Clouds over the USD over the longer-term",
    "tokens": 412,
    "text": "more easing. We expect the EUR/USD to rebound in H2 25 and trade at 1.14 in 12 months, riding on a growth recovery in Germany and narrowing rate differentials. We see GBP/USD trading around 1.31 in the near term and rise towards 1.34 over 6-12 months. Meanwhile, easing global trade tensions and fading risk aversion should support near-term upside in USD/JPY and USD/CHF. In particular, the trade-weighted CHF reached a record high in April, prompting market speculation about potential SNB intervention to weaken the currency. We see the possibility of negative Swiss interest rates by September. Commodity currencies are expected to consolidate in the near term, with a modestly bullish bias over the 12-month horizon. Despite a dovish RBA, we see AUD/USD trading around 0.65 given improving risk appetite and CNY resilience. We see NZD/USD stabilising around 0.59. New Zealand's monthly inflation is gaining momentum, which will limit RBNZ’s room to cut rates further. Canada has largely avoided additional reciprocal tariffs. With improving factory hiring towards year-end, we expect USD/CAD to trade around 1.37 over a 12-month horizon. Asian currencies are diverging in performance. We have revised our USD/CNH forecasts lower amid easing trade tensions and expectations of a weaker USD over a 12-month horizon. However, China is expected to gradually guide the CNH weaker to support export competitiveness. The SGD NEER is trading near the stronger end of its band (1.6% above the midpoint). Slowing inflation and rising growth concerns are adding downside pressure on the SGD, with the trade ministry cutting its 2025 GDP growth forecast and the MAS recently lowering its core inflation target. As a result, we expect the SGD NEER to ease toward the midpoint of the policy band, pushing USD/SGD higher toward the 1.32-1.34 range. Global Market Outlook"
  },
  {
    "id": "68d823606ad345c9b58a3701469cc505",
    "heading": "Our view",
    "tokens": 92,
    "text": "* We downgrade Gold to a core holding and expect a period of consolidation ahead. We trim our 3-month price expectation to USD 3,100 and leave our 12-month expectation unchanged at USD 3,500.  \nOur 12-month oil price forecast remains unchanged at USD 60/bbl amid still-significant supply. However, over a shorter 1- 3-month horizon, we expect prices to rebound towards USD 64/bbl."
  },
  {
    "id": "1deb58e9a99b43f4955b40159b06ab01",
    "heading": "Fig. 19 The oil market is likely to remain in surplus this year, keeping prices in check",
    "tokens": 300,
    "text": "Global central bank quarterly net gold purchases (tonnes)  \nOil supply-demand balance, price estimates  \nWe have been Overweight on gold since September last year, and this has served us well, with gold prices rising over 20% during this period. However, with tariff concerns easing, we see an opportunity to tactically take profit. Structural tailwinds — particularly robust central bank demand — remain intact, but signs of buyer fatigue among Asian investors, a key source of recent demand, suggest further near-term downside. That said, we view the consolidation in prices as healthy following the extended rally. With lingering trade uncertainty and rising US deficit concerns as Trump shifts his focus toward tax cuts, gold is expected to be well supported by new baseline floor price of around USD 3,000-3,100/oz.  \nFrom a fundamental standpoint, oil markets continue to be oversupplied relative to expected demand. We expect this supply surplus to persist through 2025, exacerbated by a continued OPEC+ rollback of prior output cuts. Therefore, we leave our 6-12-month WTI oil price expectation unchanged at USD 60/bbl. Yet, over a shorter 1-3-month horizon, we raise our price expectation slightly to USD 64/bbl. This is driven by a combination of expected dialling back of excessively bearish investor positioning and short-term positive sentiment from China policy stimulus. Middle East geopolitical risk remains the key upside risk to oil prices.  \nGlobal Market Outlook"
  },
  {
    "id": "74f76a9e20a14c13aaa1d3d05dde38ab",
    "heading": "Summary",
    "tokens": 391,
    "text": "Our stock-bond model maintained a small Overweight in global equities due to valuation and technical factors. The model’s Overweight in equities over the past two months has helped to generate an outperformance (or alpha) of 1.1%, against the 60/40 equity-bond benchmark. While year-to-date alpha remains negative at -1.3% due to a weak global equity market between late March and early April, the model’s long-term outperformance since Feb-2023 remains strong and intact, with 3.8% alpha. Our model continues to favour equities, despite weak fundamentals (slower growth and earnings). Valuations of Developed Market (DM) and Asian equities remain attractive, and a strong market breadth should continue to support the recovery in global equities.  \nOur technical framework is bullish China, US and UK equities in the short term. Our models prefer markets with relatively lower volatility scores i.e., China, the US and the UK. Our models first turned bullish on China equities in late April, followed by the US and the UK in early May. These markets have gained 5.4%, 2.2% and 3.5%, respectively. We are Neutral Asia ex-Japan, Europe ex-UK and Japan over the next 1-3 months, based on technical readings. The MSCI Japan USD index has supportive price action and market regime indicators. It is now challenging its key resistance that it has failed to break since early 2023.  \nInvestor positioning in gold and DM IG government bonds are no longer stretched. Our market diversity indicator, which uses price movements to deduce investor positioning in an asset, showed gold and DM Investment Grade government bonds were overbought in April. The indicator has now normalised for both assets, after the assets fell by 3.7% and 1.7%, respectively, below their April highs."
  },
  {
    "id": "a3fea1e954ae4f38bfd213c834a1d228",
    "heading": "Key chart",
    "tokens": 63,
    "text": "Our stock-bond model score is at +1 (out of 5), as valuation and technical factors offset negative fundamental factors.  \nFig. 20 Breakdown of our stock-bond rotation model’s scores since inception in Feb-23 Model scores are based on the total of fundamental, valuation and market breadth factors"
  },
  {
    "id": "4192122ec7eb45bf9dd7ee376a9ead4c",
    "heading": "Fig. 21 Our technical model turned bullish on S&P500 in early May",
    "tokens": 53,
    "text": ". Our technical model upgraded the S&P500 to bullish bias in early April, with the closest resistance at 6,088 and the closest support at 5,476. PP  \nS&P500 enters the bullish-bias regime “ 9  \nGlobal Market Outlook"
  },
  {
    "id": "b5a5ae4997c94884bdcfb645c89a0e4f",
    "heading": "Time is your most precious commodity — be sure to spend it wisely",
    "tokens": 190,
    "text": "Time is valuable. The days may seem long, but the years are short. So, spend your time wisely. Whether you're setting out on your investment journey, navigating the intricacies of mid-life wealth planning, or fortifying assets for the golden years, invest time today to ensure your wealth strategy is aligned to what's right for you — Today, Tomorrow, and Forever.  \nSetting aside the time now to review your plan will pay dividends in the future. Markets have moved. Your portfolio’s current asset allocation may no longer be optimally positioned to maximise the opportunities ahead. Ask yourself the following. Am | holding too much cash? Am | sufficiently allocating to growth assets for the long term? Is my portfolio diversified? Am | capturing the best opportunities? And most importantly, is my wealth working hard for me, so | don’t have to?  \nUse our SC Wealth Select framework and advisory specialists to help guide you through this process."
  },
  {
    "id": "0bf20edcc2e74ebbabfb1c2c30a68c4c",
    "heading": "Purpose",
    "tokens": 56,
    "text": "Today, Tomorrow, Forever  \nOur approach to helping you grow and manage your wealth starts with you. We use a goals- aware approach to understanding your vision of Today, Tomorrow, and Forever for yourself, your family and beyond, and then design portfolios to meet these differing needs."
  },
  {
    "id": "898a7212e688480d9df55c690362d3f7",
    "heading": "Planning for Today",
    "tokens": 56,
    "text": "Requires ensuring liquidity and income flows take centre stage.  \nUsing our ‘Today, Tomorrow and Forever’ approach, we ensure your wealth needs for the near term (Today) are met, whilst ensuring your wealth needs for the decades ahead (Tomorrow and Forever) are also planned for."
  },
  {
    "id": "2c72f3ee63314d15a499b8c96d10d6a2",
    "heading": "Securing Tomorrow",
    "tokens": 99,
    "text": "Entails a well-diversified investment and protection portfolio with a focus on growth, ensuring inflation is accounted for and risks are mitigated.  \nYour vision of ‘Today, Tomorrow and Forever’ is unique to you. Our specialist's partner with you to build well-diversified, long-term Foundation portfolios, aligned to your Today, Tomorrow, Forever needs. Opportunistic ideas are added to capture short term opportunities, as well as sufficient protection included to address you and your family’s objectives."
  },
  {
    "id": "8e00204bf37c41c9be86ec634548a88e",
    "heading": "Building for Forever",
    "tokens": 43,
    "text": "Involves greater focus on long-term returns given the time horizon of your portfolio can be measured in decades, and might also include business interests, real estate, collectibles, or charitable funds.  \nGlobal Market Outlook"
  },
  {
    "id": "1aa073daca754ba7b512875ede5eee78",
    "heading": "Principles",
    "tokens": 387,
    "text": "that stand the test of time  \nAdhering to time-tested Principles, to ensure your investment decisions remain robust and consistently applied, is paramount to your success Today, Tomorrow, and Forever. We use five Wealth Principles to guide and guardrail your wealth decisions.  \n* Missing out on the best performing days of a market can have a significantly detrimental impact on your portfolio  \n* ‘Time in the market’ and buying the market with a longer-term view provide more consistent returns that can ride out bumps along the way  \nDiscipline - Ensure consistency and prudence over your emotions  \n* Reacting to emotions such as optimism and fear can lead to poor investment decisions at the worst times  \n* Have a plan and stick to it — this helps you to stay focused on the bigger picture  \nRisk and Return — Make sure the risk is worth the return  \n* To achieve higher investment returns, you will likely have to accept a greater level of risk in your portfolio  \n* Therefore, it’s important to understand the risks and manage these on an ongoing basis  \nDiversification — Simply put, don’t put all your eggs in one basket  \n* Reduce risk by holding a variety of financial assets. Multi-asset diversification in your Foundation portfolio is important  \nAs aguide, make sure your portfolio contains a variety of asset classes and investments that have low correlation with one another  \nProtection — Don’t let the unexpected catch you unprepared  \n* Even though you may feel healthy, or financially stable now, protection offers the ability to overcome times of financial uncertainty and mitigate the long-term impact of unforeseen events on your wealth  \nTime in the Market —- A more robust strategy than timing the market  \n* A good protection plan not only safeguards your wealth today, but also considers the value of your future earnings over your lifetime, in today’s terms  \n* Predicting market selloffs is challenging, and timing your exit and re-entry is difficult"
  },
  {
    "id": "fc5d65b2be9e471d9aa351b736ad3dad",
    "heading": "Advisory Process",
    "tokens": 91,
    "text": "Following a holistic approach to managing your wealth  \nWe follow a rigorous process to ensure your needs and objectives are well-understood, and your portfolio is aligned and managed to deliver on these objectives.  \nHowever, markets constantly evolve and your needs change. Hence, we encourage you to undertake regular portfolio reviews to ensure your portfolio remains aligned to your Today, Tomorrow and Forever objectives. This proactive approach includes strategic rebalancing based on insights from our Chief Investment Office."
  },
  {
    "id": "c1fa4194851d4ae19b5e9bf7c8cada29",
    "heading": "The five-step process",
    "tokens": 92,
    "text": "Please be sure to reach out to your Relationship Manager today to arrange a portfolio review.  \nGlobal Market Outlook  \nGlobal Chief Investment Officer, Standard Chartered Bank  \nTune in to InvesTips from the CIO’s desk, a financial education podcast series designed to empower anyone and everyone with the knowledge and tools to navigate their investment journey with confidence.  \nFortnightly series on WEDNESDAYS  \nSTANDARD CHARTERED MONEY INSIGHTS"
  }
]