[
  {
    "id": "81ec98deac9b458fb07e96517be3f01e",
    "heading": "BOCHK",
    "tokens": 438,
    "text": "BOCHK 2025 Market Outlook & Investment Strategy June 2025  \nCore views  \nH Global economy | Recently, US Treasuries have steepened further. It is because of the Fed persisted in “patiently” refusing to lowering interest rates early, with market’s confidence in economic expectations improved and financial conditions eased. As a result, the trend of short-term US Treasuries indicates the expectations for the delay of first interest rate cut in 2025 until September. The rise in long-term Treasury yields implies higher neutral rates and term premiums. Over the recent period, the Eurozone economy has shown a moderate recovery, unlike the negative growth of the US economy in Q1, and the Eurozone economy grew by 0.4% quarter-over-quarter in the same period, which was better than the market’s expectations, indicating a moderate economic recovery. Nevertheless, the overall inflation in the Eurozone rose by 2.2% year-over-year, and the core inflation also rose to 2.7%, hitting a record high over the past eight months. Moving forward, the ECB needs to strike a balance between supporting economic growth and curbing inflation, and attempts to maintain policy flexibility and to make prudent response to potential risks. The BoE lowered its benchmark rate by 25 bps to 4.25% in May as expected, consisting with the market’s expectations. Market uncertainty has triggered significant volatility in global financial markets as well as declines in economic momentum, imposing a negative impact on the UK economy while severely interfering with the central bank’s interest rate decisions. Moving forward, the BoE is expected to maintain a gradual pace of rate cuts in response to economic uncertainties. On May 12th , China and US issued a joint statement, considering the 90-day pause, it is expected that the exports are likely to remain resilient in Q2 and Q3. In general, although China’s exports show resilience to a certain extent, domestic demands still need to be bolstered, and it is expected that policy easing will still be the major policy orientation for stimulating domestic demands. Moving forward, closer attention shall be paid to the timing and intensity of subsequent fiscal policies."
  },
  {
    "id": "06aa86f5404e4c3b9ce4ef88f7132b1c",
    "heading": "BOCHK",
    "tokens": 403,
    "text": "Stock market | The market sentiment improved and the US stock market is recovering the losses of the year. The risk of recession in the US is mitigated. The decline in volatility drove capital back into the stock market. Optimal economic data in Q1 and strong corporate earnings also bolstered the US stock market. Driven by the resilience in the employment market, the alleviation of the inflation, the double-digit earnings growth of S&P 500 companies for two consecutive quarters, the high valuation of the US stock market has been sustained. Due to the uncertainties arisen from policies, deterioration of the macro- economy and the increase of financing costs driven by rising long-term bond yields, it is expected that US stocks will remain volatile. In addition, European stocks experienced a reversal in April. The difference is that the European economy is less affected by changes in the trade environment, and the ECB perceives the economic trend as a slowdown rather than a recession. The ECB is widely expected to lower interest rates once again in June, and the consistent growth of market liquidity is likely to bolster the performance of European stocks. Moving forward, closer attention shall be paid to the movements of the EUR and the progress of trade talks. After China and US issued a joint statement, it has sent positive signals to the China A-share market. Monetary and fiscal policies have supported the short-term rally of China A-shares. Furthermore, policy support for large-scale consumption and technological innovation is expected to bolster the performance of related sectors. The decline in uncertainties has significantly boosted the market’s confidence and it is likely to attract funds to increase their holdings of Chinese assets, which is favorable for Hong Kong, China stocks. In addition, according to the press conference of the State Council Information Office, concerted efforts have been made from the aspects of monetary measures, financial supervision and capital market to launch a package of financial policies for bolstering the market’s sentiment. In May, Asian stocks continued to rebound with numerous stock markets experiencing a rally. At the same time,"
  },
  {
    "id": "122b8e18e21042f19f58d550308879c3",
    "heading": "BOCHK",
    "tokens": 256,
    "text": "is expected to bolster the performance of related sectors. The decline in uncertainties has significantly boosted the market’s confidence and it is likely to attract funds to increase their holdings of Chinese assets, which is favorable for Hong Kong, China stocks. In addition, according to the press conference of the State Council Information Office, concerted efforts have been made from the aspects of monetary measures, financial supervision and capital market to launch a package of financial policies for bolstering the market’s sentiment. In May, Asian stocks continued to rebound with numerous stock markets experiencing a rally. At the same time, capital outflows from the US provided liquidity for Asian stocks to rise. Many Asian countries have maintained accommodative fiscal and monetary policies amid trade uncertainties. Moving forward, message from the policy aspect may continue to disrupt the stock market. Overseas investors have been engaged in substantial net purchases of Japanese stocks, leading to a rebound of the market. Benefiting from the economic recovery and stock market reform, Japanese stocks have become increasingly attractive for investors, started to compete with China A-shares and Indian stocks for investment funds in Asia. In addition, the Japanese government and large investment companies are stepping up their efforts to attract global funds, which is expected to bolster the performance of Japanese stocks in the long run. information contained in"
  },
  {
    "id": "9c689824acd446be8c9fcb6315eb3db8",
    "heading": "BOCHK",
    "tokens": 377,
    "text": "uncertainties. Moving forward, message from the policy aspect may continue to disrupt the stock market. Overseas investors have been engaged in substantial net purchases of Japanese stocks, leading to a rebound of the market. Benefiting from the economic recovery and stock market reform, Japanese stocks have become increasingly attractive for investors, started to compete with China A-shares and Indian stocks for investment funds in Asia. In addition, the Japanese government and large investment companies are stepping up their efforts to attract global funds, which is expected to bolster the performance of Japanese stocks in the long run. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. = Bond market | In the near term, the US bond market may still experience volatility due to a number of factors. Against such backdrop, it is strategically possible to leverage shorter-term US bonds to lock in interest rates while reducing the impact on bond prices when interest rates fluctuate. Bloomberg Barclays pan-European composite sovereign bonds and pan-European investment-grade bonds have minimum yields of one standard deviation above the 10-year average, indicating attractive levels of valuation. When European bond yields experience a rebound, investors may consider increasing the asset allocation into European bonds to capture the potential opportunities of rising bond prices. While market sentiment improved, and the stable and loose market liquidity, there is a relatively high chance for the bond market to experience volatility within a narrow range, and there could be divergent performance between long-term and short-term bonds. Chinese USD bonds have shown their cost- effectiveness in terms of asset allocation, and closer attention shall be paid to the opportunities of capital gains brought about by the rising expectations for the Fed’s rate cuts. The spread advantages in emerging bond markets are not evident, and investors shall continue to wait for opportunities."
  },
  {
    "id": "9878b350b43243888e70cde438bc6e92",
    "heading": "BOCHK",
    "tokens": 317,
    "text": "= Commodities | In June, the trend of gold market is still dominated by safe-haven demands, the movements of the USD, and the Fed’s policy, whereas the market is expected to resume the risk appetite sentiment in the near term. Moreover, gold prices are likely to fluctuate at short-term highs. In the mid-to long-term, the difference in the expectations of interest rate cuts may lead to a short-term adjustments in gold prices, but the upward trend remains unchanged in the long run. Moreover, investors need to continue to pay closer attention to the subsequent progress of the trade policies, the Fed’s interest rate decisions, and the dynamics of gold purchases by central banks. In the short-term, the RMB is in the stage of appreciation. Amid corrections of gold prices, investors may arrange gold purchases in batches at a relatively low price. Crude oil prices are expected to experience a rebound amid restoration as driven by demands. On the demand side, China’s economic data showed strong performance, has reduced the pessimism about the impact of US policies on the global economy, which was positive for crude oil prices. In addition, the US travel demand has entered into a relatively peak season. On the supply side, the OPEC alliance continues to signal an increase in production, but the actual implementation of member countries varies to some extent, providing support for oil prices at bottom in the short term. Foreign exchange | The USD index returned above the level of 100 in mid-May. Moving forward to June, trade uncertainties are still a crucial variable. In addition, the impact imposed"
  },
  {
    "id": "c7d3225e98dd46efa20fa8068d76b2e7",
    "heading": "BOCHK",
    "tokens": 434,
    "text": "has reduced the pessimism about the impact of US policies on the global economy, which was positive for crude oil prices. In addition, the US travel demand has entered into a relatively peak season. On the supply side, the OPEC alliance continues to signal an increase in production, but the actual implementation of member countries varies to some extent, providing support for oil prices at bottom in the short term. Foreign exchange | The USD index returned above the level of 100 in mid-May. Moving forward to June, trade uncertainties are still a crucial variable. In addition, the impact imposed by the previous round of policies on the global economy will begin to be reflected in subsequent economic data. June is a vital month as major central banks will hold policy meetings to decide upon interest rates, which will provide crucial guidance on the orientation of monetary policy in H2, 2024. Furthermore, the foreign exchange market will trade around the above variables. With respect to specific currencies, US dollar: USD is expected to temporarily stabilize in the short term, and closer attention shall be paid to the progress of further trade talks. Euro: EUR is constrained by economic prospects on the downside, and monetary policies on the upside, and is likely to remain volatile at highs. British pound: GBP’s movements are exposed to slowdown of economic growth, shift towards dovish policy and outflow of capital. Japanese Yen: JPY is influenced by the temporary easing of market risk appetites, and closer attention shall be paid to subsequent trade developemt between the US and Japan. With respect to commodity currencies, Canadian dollar: CAD is likely to oscillate within a range amid a rather weak pattern. Australian dollar: AUD is expected to oscillate with a rather bullish pattern, and attention shall be paid to key support levels. Renminbi: RMB is likely to remain basically stable at a reasonable and balanced level against the backdrop of market risk appetite eases as well as maintenance of policy support. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "e75673a413844904b6661b4007119d7a",
    "heading": "Global Economy",
    "tokens": 460,
    "text": "Fig. 1: Monthly CPI YoY (As of April 30, 2025) Fig. 2Monthly Manufacturing PMI YoY (As of April 30, 2025) Although US stocks have recovered all of their losses so far in 2025, US Treasuries have steepened further. The Fed persisted in “patiently” refusing to lowering interest rates early, and the implementation of US trade policy delayed. Moreover, economic expectations improved and financial conditions eased. As a result, the trend of short-term US Treasuries indicates the expectations for the delay of first interest rate cut in 2025 until September. The rise in long-term Treasury yields implies higher neutral rates and term premiums. The rise in term premiums originates from a number of factors: First, due to the complexity of the influencing factors, the market’s confidence in economic prospects, inflation, the Fed’s policy forecasts has weakened. Second, the US government has yet to formulate a long-term plan to manage debt. Third, international investors are increasingly concerned about the risks of holding US Treasuries. All of these factors have led to a lack of demands for US bonds, and investors are naturally demanding higher returns in the face of uncertainties, prompting the US government to pay a higher risk premium on funding costs. Interest payments have soared due to high interest rates as previously low-yield US bonds continue to roll over to maturity, thereby further affect the fiscal problem and posing a major constraint to the tax cut bill for which Trump advocates. Eurozone: The Eurozone economy is experiencing a moderate recovery, and prudent monetary policies are adopted to cope with inflation risks Over the recent period, the Eurozone economy has shown a moderate recovery, unlike the negative growth of the US economy in Ql, and the Eurozone economy grew by 0.4% quarter-over-quarter in the same period, which was better than the market’s expectations, indicating a moderate economic recovery. Nevertheless, the IMF lowered its economic forecast for the Eurozone in 2025 to 0.8%, and. the growth rates of Germany, France and Italy were also lowered to 0%, 0.6% and 0.4%, indicating the market’s uncertainties about economic prospects. With respect to the inflation of major"
  },
  {
    "id": "a8da803a684349428a6b0d386fb0a511",
    "heading": "Global Economy",
    "tokens": 313,
    "text": "monetary policies are adopted to cope with inflation risks Over the recent period, the Eurozone economy has shown a moderate recovery, unlike the negative growth of the US economy in Ql, and the Eurozone economy grew by 0.4% quarter-over-quarter in the same period, which was better than the market’s expectations, indicating a moderate economic recovery. Nevertheless, the IMF lowered its economic forecast for the Eurozone in 2025 to 0.8%, and. the growth rates of Germany, France and Italy were also lowered to 0%, 0.6% and 0.4%, indicating the market’s uncertainties about economic prospects. With respect to the inflation of major economies in the Eurozone, the inflation rates of Germany, France, Italy and Spain reached 2.2%, 0.8%, 2.1% and 2.2% respectively in April. The overall inflation in the Eurozone rose by 2.2% year-over- year, and the core inflation also rose to 2.7%, hitting a record high over the past eight months. The inflation data were higher than the market’s expectations, and the inflation of the service sector rose to 3.9%. Although the increasing inflation may be mainly driven by short-term stimulus effects of vacation and holiday in April, the overall level still shows the resilience of the service industry, thus imposing pressure on the inflation in general. With respect to the monetary policy, the ECB has lowered its interest rates seven times since June 2024, bringing the"
  },
  {
    "id": "09c8f0b16894405296b07613583106a1",
    "heading": "Global Economy",
    "tokens": 391,
    "text": "the Eurozone rose by 2.2% year-over- year, and the core inflation also rose to 2.7%, hitting a record high over the past eight months. The inflation data were higher than the market’s expectations, and the inflation of the service sector rose to 3.9%. Although the increasing inflation may be mainly driven by short-term stimulus effects of vacation and holiday in April, the overall level still shows the resilience of the service industry, thus imposing pressure on the inflation in general. With respect to the monetary policy, the ECB has lowered its interest rates seven times since June 2024, bringing the deposit rate to 2.25%. Over the recent period, numerous members of the ECB’s Governing Council have expressed their open attitude towards interest rate cuts in June and beyond, but at the same time, the central bank will closely monitor potential inflationary pressure and signal that further rate cuts should be cautious. This is mainly attributable to global economic uncertainties and the possibility that higher defense spending in Europe could push up inflation in the medium term, or limit the room for monetary policy easing. The market’s expectations for the number of rate cuts by the end of the year have fallen from three in early May to merely two at present (interest rate reduction of 25 bps at each of the time). Overall, the Eurozone economy is in a modest phase of recovery, but the inflationary pressure remains to be a concern. Moving forward, the ECB needs to strike a balance between supporting economic growth and curbing inflation, and attempts to maintain policy flexibility and to make prudent response to potential risks. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. UK: The BoE lowered the benchmark rate as scheduled in May, and policy signals remain unclear for subsequent rate cuts rate cuts"
  },
  {
    "id": "6461aaf0be824913aa1e83beaec188e5",
    "heading": "Global Economy",
    "tokens": 261,
    "text": "information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. UK: The BoE lowered the benchmark rate as scheduled in May, and policy signals remain unclear for subsequent rate cuts rate cuts On May 8, the BoE’s Monetary Policy Committee voted 5-4 in favor of the quarter-point reduction of interest rates to 4.25%, consisting with the market’s expectations. The BoE has cut interest rates four times since August 1, 2024. According to the UK central bank, due to rising international energy prices and increasing domestic prices, the inflation is expected to rise briefly to 3.5% in Q3, 2025, and then gradually fall back to 2%. The BoE will delved into aggregate demand over the next one to two years and, accordingly, determine the path of interest rates to match aggregate supply. The uncertainties of trade policy has triggered significant volatility in global financial markets and declines of economic momentum, imposing a negative impact on the UK economy and influencing the interest rate decisions. The BoE is expected to maintain a gradual pace of rate cuts in response to economic uncertainties. The interest rate decision in May"
  },
  {
    "id": "79ef8176b79d4fc9839a7ede618a5ea3",
    "heading": "Global Economy",
    "tokens": 373,
    "text": "the inflation is expected to rise briefly to 3.5% in Q3, 2025, and then gradually fall back to 2%. The BoE will delved into aggregate demand over the next one to two years and, accordingly, determine the path of interest rates to match aggregate supply. The uncertainties of trade policy has triggered significant volatility in global financial markets and declines of economic momentum, imposing a negative impact on the UK economy and influencing the interest rate decisions. The BoE is expected to maintain a gradual pace of rate cuts in response to economic uncertainties. The interest rate decision in May did not convey to the market a clear orientation for the subsequent monetary policy. First, the BoE remains highly sensitive to the current economic environment, and the direction of inflation will depend on the dynamics between the global economy and domestic consumption. Second, members of the Monetary Policy Committee of the BoE have experienced tripartite disagreements. The number of members supporting a 25-bp rate cut continued to account for a slight majority. Moreover, two members were in favour of keeping the current rate unchanged, and two members were in favor of a 50-bp rate cut. Megan Greene, who had previously clearly expressed concerns about the downside in inflation, only supported a 25-bp rate cut. Last but not least, there is also a disagreement between the BoE and the market. Compared with the previous forecast, the BoE believes that the inflation will approach the 2% target sooner, and the national think tank National Institute of Economic and Social Research (NIESR) believes that the current tight labor market and the increase in the corporate pricing cap will delay the time for inflation to fall. The BoE will announce its next interest rate decision on June 19, and closer attention shall be paid to the inflation and employment data for April and May."
  },
  {
    "id": "9c84298e73514971ac3864fb2281f6fc",
    "heading": "China: Exports remained strong in April",
    "tokens": 357,
    "text": "Exports rose by 8.1% year-over-year in April (previous value was 12.4%), while imports fell by 0.2% year-over-year (previous value was 4.3). Exports grew significantly faster than expected, and the trade rush and entrepot trade may be the major contributing factors. Considering the 90-day pause of tariffs, it is expected that the follow-up trade rush will continue in Q2 and Q3. Judging from the historical experience, driven by the support of trade rush, the export growth rate in 2018 remained at a high level. In 2025, importers of China’s goods will be more widely distributed, and the export competitiveness of Chinese products has been significantly improved. As such, China’s exports are likely to remain resilient. In April, the CPI fell by 0.1% year-over-year (previous value was a decline of 0.1%) and rose by 0.1% month-over-month (previous value was a decline of 0.4%). The core CPI rose by 0.5% year-over-year in April (previous value was an increase of 0.5%) and 0.2% month-over-month (unchanged month-over-month). The core CPI maintained the trend of rebound month-over-month for the time being. In April, the PPI fell by 2.7% year-over-year (previous value was a decline of 2.5%) and decreased by 0.4% month-over-month (previous value was a decline of 0.4%). In a nutshell, although the core CPI continues to rebound month-over-month, the overall price remains low. According to the monetary policy implementation report of the PBOC for"
  },
  {
    "id": "ed15a25fe93e43eaa68e3e6ce11669a6",
    "heading": "China: Exports remained strong in April",
    "tokens": 452,
    "text": "and rose by 0.1% month-over-month (previous value was a decline of 0.4%). The core CPI rose by 0.5% year-over-year in April (previous value was an increase of 0.5%) and 0.2% month-over-month (unchanged month-over-month). The core CPI maintained the trend of rebound month-over-month for the time being. In April, the PPI fell by 2.7% year-over-year (previous value was a decline of 2.5%) and decreased by 0.4% month-over-month (previous value was a decline of 0.4%). In a nutshell, although the core CPI continues to rebound month-over-month, the overall price remains low. According to the monetary policy implementation report of the PBOC for Q1, 2025, “with respect to the price control, it is necessary to shift from the previous approach of managing high prices into controlling low prices. from supporting scale expansion into high-quality development, and from anti-monopoly into prevention against disorderly competition”. The policy shift has reflected that low price could be the new norm for a period of time, and greater policy efforts are expected to be made to promote a reasonable price recovery. Tn general, although exports show resilience to a certain extent, domestic demands still need to be bolstered. According to the Politburo meeting in April, China will “step up efforts to better leverage” more proactive fiscal policy and moderately loose monetary policy, alongside introducing a raft of incremental policies at opportune moments. On May 7, the PBOC announced a 0.5 percentage point RRR cut, a 0.1 percentage point cut in the policy rate, in addition to a 0.25 percentage point cut in the interest rate on all structural monetary policy instruments. It is expected that policy easing will still be the major policy orientation for stimulating domestic demands. Moving forward, closer attention shall be paid to the timing and intensity of subsequent fiscal policies. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "84fefe01b01f4f4983ecc45e9315a42d",
    "heading": "Stock Market",
    "tokens": 41,
    "text": "Fig. 3: Stock Index Movements (as of April 30, 2025)  \nFig. 4: Stock Index Valuation (as of April 30, 2025)"
  },
  {
    "id": "a7cf12c61f414e3b89c74e9b8d2c3800",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 485,
    "text": "The US and China issued “Joint Statement on China-US Economic and Trade Meeting in Geneva”, the three major U.S. stock indexes continued to rebound and US stocks have recovered almost all of their losses so far in 2025. The contractionary effects of corporate investments due to policy uncertainties have also been reduced. Moreover, potential tax cuts have enhanced the market’s confidence that the US economy could avoid a recession and maintain high growth. The US options market significantly lowered its pricing in risk events, with the VIX rapidly falling from a level of 60 to a normal level of 18, and a drop in volatility has driven capital back into the stock market. Besides mitigating trade policy risks, the momentum of the rally in US stocks lies in optimal macroeconomic data in Q1, 2025, as well as the strong corporate earnings performance. Although the real GDP of the US in Q1, 2025 contracted by 0.3% quarter-over-quarter, it grew by 3% in real terms after excluding the disturbance of import hoarding. The US employment remained resilient, with non-farm payrolls exceeding the market’s expectations in April. Moreover, the unemployment rate remained low at 4.2%, and weekly jobless claims also held steady at around 230,000. The inflation rate returned to the downward channel, and the PCE and core PCE price indices recorded zero month-over-month growth in March, falling to 2.3% and 2.6% year-over-year respectively, further approaching the policy target. The S&P 500 corporate earnings grew by 13.4% year-over-year in Q1, 2025, marking two consecutive quarters of double-digit year-over-year growth, and the median full-year earnings growth forecast reached 13%, bolstering the high valuation of US stocks. Nevertheless, subsequent to the sharp rise, the market has fully priced in the easing of the trade policy development and the resilience of the economy, and should instead pay closer attention to the risks of uncertainties and change of macroeconomic data. In addition, the postponement of the Fed’s rate cuts and the further rise in long-term US Treasury yields have also put increasing pressure on the financing costs and stock valuations of economic entities. Europe: Market’s sentiment fluctuates, European stocks are expected to remain volatile The risk aversion sentiment has been alleviated in the market. In"
  },
  {
    "id": "b7e4ffecca6548e89b7e5d4bc4733b73",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 285,
    "text": "valuation of US stocks. Nevertheless, subsequent to the sharp rise, the market has fully priced in the easing of the trade policy development and the resilience of the economy, and should instead pay closer attention to the risks of uncertainties and change of macroeconomic data. In addition, the postponement of the Fed’s rate cuts and the further rise in long-term US Treasury yields have also put increasing pressure on the financing costs and stock valuations of economic entities. Europe: Market’s sentiment fluctuates, European stocks are expected to remain volatile The risk aversion sentiment has been alleviated in the market. In particular, the Stoxx Europe 600 Index rebounded more than 17% from its April lows to the level at the time of writing, and returned to its level at the end of March. The uptrend is broad-based, with nearly 70% of the index component stocks trading above their 50-day moving averages. The rally has been partly due to the progress of trade talks boosting the market’s sentiment, and partly due to the reassurance given to the market by the ECB’s officials. From the perspective of the chief economist of the ECB, the Eurozone economy is still growing, and there is a low chance for the Eurozone economy to experience a recession due to the trade environment. In addition, according to the ECB, although the economic growth forecast for the year 2024 and 2025 has been"
  },
  {
    "id": "706aa3a290214059a588af1ed30ebc09",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 404,
    "text": "is broad-based, with nearly 70% of the index component stocks trading above their 50-day moving averages. The rally has been partly due to the progress of trade talks boosting the market’s sentiment, and partly due to the reassurance given to the market by the ECB’s officials. From the perspective of the chief economist of the ECB, the Eurozone economy is still growing, and there is a low chance for the Eurozone economy to experience a recession due to the trade environment. In addition, according to the ECB, although the economic growth forecast for the year 2024 and 2025 has been revised down to 0.9% and 1.2% respectively. The ECB’s President Christine Lagarde has also stressed the increased downside risks to economic growth. From the aspect of the ECB, the Eurozone economy is slowing down instead of contracting. Moreover, following the BoE’s interest rate cuts in May, it is widely expected by the market that the ECB would lower interest rates again at the policy meeting in June, and the market liquidity is likely to further increase, thus bolstering the economic development and maintaining the trend of European stocks. The fundamentals of the Eurozone are partly reflected in the recent appreciation of the EUR, which rose to its record high against the USD since 2021 and is around the level of 1.12 at the time of writing. A stronger exchange rate could weaken the attractiveness of European exporters. Moving forward, the progress made in the trade agreements between the EU and other countries and the outlook for the Eurozone economy will be of great focus. In the face of rapidly changing market signals, both positive and negative news will continue to dominate changes of the market’s sentiment, and after a round of rebound, it is inevitable for European stocks to remain volatile. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "feb39731964b4ff6a9b08bbee4302376",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 420,
    "text": "information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. China: A-shares are expected to show a relatively independent trend, while Hong Kong, China stocks may continue to restore their valuations China and US issued a joint statement in May, global economic uncertainties have eased. It has sent more positive signals to the China A-share market. In June, the China A-share market is likely to benefit from the improvement of the external environment and policy support, showing a relatively independent trend. The Chinese mainland economic recovery is still facing challenges, but driven by the consistent support of monetary and fiscal policies, especially the implementation of the policy of “lowering the reserve requirement ratio and interest rates”, China A-shares may continue to fluctuate upward in the short term. Intensified policies, especially support for large-scale consumption, technological innovation and enterprises, will promote the performance of relevant industry sectors. Policy support will also stimulate domestic demands, enhance consumer confidence, and promote the performance of the consumer sector. The ease of the market tension facilitated the export-oriented industrial chains And it will also boost the development of technological companies and drive long-term growth in the technological sector, especially in high-end manufacturing, semiconductors, 5G and new energy. Driven by the dual support of the improved external environment and the Chinese mainland’s policies, the technological sector and export-oriented industries in the China A-share market are expected to usher in better performance in June. Overseas, the Fed announced that it would keep the target range of the federal funds rate unchanged between 4.25% and 4.50% in May. The market’s expectations for a rate cut in June once rose sharply, whereas the USD index came under pressure. Uncertainties over Trump’s policies may impose an impact on the market’s risk aversion sentiment, and the importance of independent and controllable technology in the mid-to long-term will be further highlighted. Moving forward, potential risks include"
  },
  {
    "id": "defb0b48f5494689b906fbe14affb256",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 272,
    "text": "Chinese mainland’s policies, the technological sector and export-oriented industries in the China A-share market are expected to usher in better performance in June. Overseas, the Fed announced that it would keep the target range of the federal funds rate unchanged between 4.25% and 4.50% in May. The market’s expectations for a rate cut in June once rose sharply, whereas the USD index came under pressure. Uncertainties over Trump’s policies may impose an impact on the market’s risk aversion sentiment, and the importance of independent and controllable technology in the mid-to long-term will be further highlighted. Moving forward, potential risks include the recurrence of global policies, uncertainties over the Trump administration’s policies, uncertainties over the external economic environment and especially the volatility caused by the changing expectations for the Fed’s interest rate cuts, and the progress of the Chinese mainland’s policy stimulus measures. In April, global stock markets experienced mixed performance, with Hong Kong, China stocks underperforming overall. With respect to the industrial performance, the Hang Seng industries experienced declines more than rises in April. In particular, the public utilities sector has led the gains. The consumer discretionary and energy sectors have experienced the most evident declines. In May, Hong Kong, China stocks started to rebound. Looking forward to June, the restoration of valuation is expected to continue in the"
  },
  {
    "id": "01e428ceb4c8480fb815799b3c67272a",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 375,
    "text": "the volatility caused by the changing expectations for the Fed’s interest rate cuts, and the progress of the Chinese mainland’s policy stimulus measures. In April, global stock markets experienced mixed performance, with Hong Kong, China stocks underperforming overall. With respect to the industrial performance, the Hang Seng industries experienced declines more than rises in April. In particular, the public utilities sector has led the gains. The consumer discretionary and energy sectors have experienced the most evident declines. In May, Hong Kong, China stocks started to rebound. Looking forward to June, the restoration of valuation is expected to continue in the Hong Kong, China stock market. On one hand, China and US joint statement improvement of the market’s confidence, which is expected to further attract incremental funds to deploy Chinese assets and promote the further recovery of Hong Kong, China stock valuations. On the other hand, in the recent meeting held by the State Council Information Office, a package of blockbuster financial policies have been rolled out, revealing the coordinated efforts made by the Chinese mainland’s financial regulatory authorities in monetary policy, financial supervision and capital market. These incremental policies have fully sent positive signals, imposing a positive effect on the market’s sentiment to some extent. Potential risks include uncertainties over the global economic environment, transmission efficiency of monetary policies, volatility of the financial markets, implementation and coordination of policies, and management of the market’s confidence. Investors are recommended to consistently pay attention to the above risk factors that may affect the overall performance of the Hong Kong, China stock market. The information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Asia ex-China: Japanese stocks have temporarily stabilized subsequent to major shocks, and Asian markets are expected to maintain accommodative policies to support local economic growth"
  },
  {
    "id": "385d3f0570ab44a7b72b41440edb6c0d",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 304,
    "text": "The information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Asia ex-China: Japanese stocks have temporarily stabilized subsequent to major shocks, and Asian markets are expected to maintain accommodative policies to support local economic growth In addition, Japanese stocks have experienced a V-shaped reversal from April to early May, with overseas investors becoming vital contributors. In particular, the overseas investors have been engaged in the net purchases of Japanese stocks and investment funds worth of JPY 3.68 trillion in April, hitting the third highest level on record. The BoJ kept interest rates unchanged and postponed expectations for the timing of achieving its inflation target, thus weakening the JPY. Investment banks have delayed the expectations for the timing of the next rate hike to be adopted by the BoJ. The overnight swaps market suggests a less than 40% chance of a rate ike by the end of the year, significantly lower than in early April. The BoJ’s dovish policy indicates that the policy focus has shifted from domestic issues to potential trade policy implications. In addition, thanks to the improvement in the performance of the manufacturing sector, the reform of the Oriental Stock Exchange, and the undervaluation of Japanese stocks due to the depreciation of the JPY, Japanese stocks have gradually become more attractive for investors, and started to compete with China A-shares and Indian stocks for investment funds in Asia. Japan’s"
  },
  {
    "id": "0c5bad0c76124b3999b1bc812d7fa09c",
    "heading": "US: US stocks are expected to oscillate at highs after recovering losses",
    "tokens": 424,
    "text": "market suggests a less than 40% chance of a rate ike by the end of the year, significantly lower than in early April. The BoJ’s dovish policy indicates that the policy focus has shifted from domestic issues to potential trade policy implications. In addition, thanks to the improvement in the performance of the manufacturing sector, the reform of the Oriental Stock Exchange, and the undervaluation of Japanese stocks due to the depreciation of the JPY, Japanese stocks have gradually become more attractive for investors, and started to compete with China A-shares and Indian stocks for investment funds in Asia. Japan’s Ministry of Finance has requested China to expand the quota for overseas securities investment so that funds could flow to the Japanese stock market. Major Japanese investment companies are seizing the opportunities brought about by global capital outflow from the US for reallocation of assets. These companies are proactively expanding their overseas Japanese stock sales network, which is likely to bolster the performance of Japanese stocks in the long run. Driven by the market’s optimism, the MSCI Asia ex-Japan Index rebounded sharply by more than 20% from its lows in early April, and the rebound was mainly driven by Chinese stocks. Elsewhere in Asia, stock markets in Korea, Thailand and Indonesia generally tose. In addition to the development of trade relations, the USD index has repeatedly retreated, bringing financial support to Asian stock markets. For instance, Korea’s Ministry of Finance proposed a KRW 12 trillion worth of supplementary budget plan in mid- April to bolster its export-dependent economy, which is expected to facilitate the development of related businesses. Nevertheless, it shall be noted that the Korean presidential election will be held in June, which may bring uncertainties to fiscal policy and the stock market. As Asian stocks have rebounded quite a bit, both positive and negative news are expected to consistently dominate the stock market performance while bringing volatility to the market. The information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "a9c7a97bdb994f0aa47a6cbd5fd0b410",
    "heading": "Bond Market",
    "tokens": 413,
    "text": "Fig. 5 and Fig. 6: Government Bond Yields as of April 30, 2025) US bonds: The US 10-year Treasury yield fluctuated by 73 bps in April, and the volatility has been the largest in more than two years. The volatility of bond yields decreased slightly in the first half of May, when the 10-year Treasury yield had recovered from a monthly low of 4.1% to around 4.5%. The Fed kept interest rates unchanged for the third consecutive time at the FOMC meeting in May. From its perspective, the risks of rising inflation and unemployment in the US have intensified, but at the same time, it believes that the current solid job market reflects that the US economy is still solid. Hence, the Fed is not in a hurry to cut interest rates. On the other hand, the latest year-over-year CPI and core CPI growth in April dropped to 2.3% and remained at 2.8% respectively, indicating that the inflation has maintained a downward trend year-to-date. The Fed has become cautious about lowering interest rates due to rising uncertainties about the economic outlook, and the slowdown in inflation has led to a decrease of expectations for interest rate cuts, thus supporting the rise in US Treasury yields. At present, the expectations for rate cuts are subject to the impact of economic growth, inflation and dynamics of the peripheral factors. Prior to evident slowdown of the economy, the Fed is expected to maintain the current interest rate level to curb the inflation that might potentially surge, thus posing constraints to the Fed’s room of rate cuts. As such, investors may leverage short-term US bonds from a tactical perspective to lock in interest rates and to help alleviate the impact on bond prices when interest rates fluctuate. European bonds: The ECB lowered interest rates by 25 bps at its policy meeting in April as expected by the market, which has been the seventh rate reduction since the start of the rate cut cycle in June 2024. According to the policy statement after"
  },
  {
    "id": "bd3e913ce23d49ac8739659e44595053",
    "heading": "Bond Market",
    "tokens": 267,
    "text": "to maintain the current interest rate level to curb the inflation that might potentially surge, thus posing constraints to the Fed’s room of rate cuts. As such, investors may leverage short-term US bonds from a tactical perspective to lock in interest rates and to help alleviate the impact on bond prices when interest rates fluctuate. European bonds: The ECB lowered interest rates by 25 bps at its policy meeting in April as expected by the market, which has been the seventh rate reduction since the start of the rate cut cycle in June 2024. According to the policy statement after the meeting, the Eurozone economy is expected to slow down due to heightened market uncertainties that may further affect the economic outlook of the Eurozone, and may continue to rely on data and a meeting-by-meeting approach to decide upon interest rate cuts. Judging from the economic data, although the Eurozone manufacturing PMI rebounded to 49 in April, it remained at a contraction level for 34 consecutive months. In addition, the IMF lowered the Eurozone economic growth forecast for the year 2025 from 1% to 0.8% in the World Economic Outlook released in April, indicating that the Eurozone economy is still weak. Moreover, it is expected by the market that the ECB would continue to lower interest rates in 2025."
  },
  {
    "id": "85d510baaf47436ead50c5d95a8f6075",
    "heading": "Bond Market",
    "tokens": 421,
    "text": "the economic outlook of the Eurozone, and may continue to rely on data and a meeting-by-meeting approach to decide upon interest rate cuts. Judging from the economic data, although the Eurozone manufacturing PMI rebounded to 49 in April, it remained at a contraction level for 34 consecutive months. In addition, the IMF lowered the Eurozone economic growth forecast for the year 2025 from 1% to 0.8% in the World Economic Outlook released in April, indicating that the Eurozone economy is still weak. Moreover, it is expected by the market that the ECB would continue to lower interest rates in 2025. However, the German 2-year and 10-year bond yields have fallen after hitting year-to-date highs of around 2.314% and 2.938% in March, and once reached low levels of 1.620% and 2.428%, respectively. Against the backdrop of significant declines in European bond yields in a short period of time, coupled with the cooling of risk aversion sentiment in the market over the recent period, the German 2-year and 10-year bond yields have rebounded to about 1.909% and 2.647%. However, the ECB is still in a cycle of rate cuts, and it is expected that European bond yields will still be on a downward channel. At present, Bloomberg Barclays Pan-European Composite Sovereign Bonds and Pan-European Investment-grade Bonds have minimum yields of one standard deviation above the 10-year average, indicating attractive levels of valuation. Therefore, whenever European bond yields rebound, investors may consider increasing asset allocation into European bonds to capture the potential opportunities for bond prices to rise. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Emerging markets: China’s domestic bond market fluctuated within a narrow range, with Chinese USD bonds showing cost-effectiveness for asset allocation, and attention shall be paid to opportunities in emerging market bonds"
  },
  {
    "id": "8b823a7efbc34a6cb22bfd13f1ab2ac9",
    "heading": "Bond Market",
    "tokens": 405,
    "text": "information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Emerging markets: China’s domestic bond market fluctuated within a narrow range, with Chinese USD bonds showing cost-effectiveness for asset allocation, and attention shall be paid to opportunities in emerging market bonds China’s bond market: After China and the US issued joint statement and the stable and loose market liquidity, there is a relatively high chance for the bond market to experience volatility within a narrow range in June, and there could be divergent performance between long-term and short-term bonds, whereas the curve tends to steepen. From a policy perspective, in May, the PBOC launched 10 supportive monetary policies in three categories. The central bank once again cut the reserve requirement ratio and interest rates. In particular, a 0.5 percentage point reduction in the reserve requirement ratio has released about RMB 1 trillion worth of long-term funds. Judging from the description of the central bank’s monetary policy implementation report for the first quarter, compared with the previous stance of monetary policy to maintain the stability of the exchange rate and to prevent the issue of idle capital, monetary policies in the next stage will tend to facilitate economic growth, and the capital environment is expected to be more friendly for investors in the market. From a fundamental point of view, the CPI in April reached decreasing 0.1% year- over-year, and the PPI was decreasing 2.7% year-over-year. Moreover, exports grew by 8.1% year-over-year, whereas imports decreased by 0.2% year-over-year. The aggregate financing to the real economy (AFRE) went up by RMB 1.22 trillion year-over- year, and the M2 growth rate reached 8.0%. In particular, the export data slightly exceeded the market’s expectations, and the AFRE maintained rapid growth,"
  },
  {
    "id": "2c0985237c564089a5ff3245a1bef652",
    "heading": "Bond Market",
    "tokens": 278,
    "text": "monetary policies in the next stage will tend to facilitate economic growth, and the capital environment is expected to be more friendly for investors in the market. From a fundamental point of view, the CPI in April reached decreasing 0.1% year- over-year, and the PPI was decreasing 2.7% year-over-year. Moreover, exports grew by 8.1% year-over-year, whereas imports decreased by 0.2% year-over-year. The aggregate financing to the real economy (AFRE) went up by RMB 1.22 trillion year-over- year, and the M2 growth rate reached 8.0%. In particular, the export data slightly exceeded the market’s expectations, and the AFRE maintained rapid growth, but the year-over-year increase in corporate and retail loans was small. The growth of domestic demand still had a large room for improvement, and the subsequent growth of economic fundamentals is still in need of the support of a relatively low interest rate environment. From the perspective of the market environment, ,the market’s risk appetites have been restored. Nevertheless, considering the continuity of the progress of trade talks, the upside of long-term bonds may be relatively limited, and is not expected to exceed the high level achieved in Q1, 2025. In a nutshell, we believe that interest rates are still in a downward channel"
  },
  {
    "id": "ea1df1ce9b53404b9e5da7039de705fe",
    "heading": "Bond Market",
    "tokens": 378,
    "text": "in corporate and retail loans was small. The growth of domestic demand still had a large room for improvement, and the subsequent growth of economic fundamentals is still in need of the support of a relatively low interest rate environment. From the perspective of the market environment, ,the market’s risk appetites have been restored. Nevertheless, considering the continuity of the progress of trade talks, the upside of long-term bonds may be relatively limited, and is not expected to exceed the high level achieved in Q1, 2025. In a nutshell, we believe that interest rates are still in a downward channel during the year, but the timing of further downward movements needs to be supported by incremental monetary policies. Moving forward, closer attention shall be paid to the Fed’s interest rate decisions and its policy statements in June. Chinese USD bond market: Against the backdrop of rising US bond yields, the declines in the market’s risk appetites and the tightening of liquidity brought about by trade policy changes, the yields of varying Chinese USD bond bonds have risen across different sectors. Taking the iBoxx Index as an example, the yields of Chinese USD bonds overall and the real estate sector rose significantly. In particular, the Markit iBoxx Asian Chinese USD real estate bond index rose by 1.21% in a single week in May, reaching a record high in 2025. From the aspect of spreads, as of May 9, the spreads of Chinese USD bonds reached 147.42 bps, of which the spreads of investment-grade bonds reached 82.82 bps. Moreover, the spreads of high-yield bonds reached 546.86 bps. Against the backdrop of marginal easing of policy, Chinese USD bonds have shown their cost-effectiveness in June, and closer attention shall be paid to the opportunities of capital gains brought about by the rising expectations for the Fed’s rate cuts."
  },
  {
    "id": "fbe8ba61ca9a49d39b5fa848c7b7e450",
    "heading": "Bond Market",
    "tokens": 224,
    "text": "Global emerging bond markets: According to the latest data from EPFR Global, emerging bond markets recorded inflows of approximately USD 1.87 billion from April 17 to May 7. As can be seen, the recent cooling of the risk aversion sentiment in the market has led to the inflow of funds into emerging bond markets. However, as of the beginning of the year, emerging bond markets still recorded net outflows of about USD 3.08 billion. Faced with uncertainties, emerging bond markets could come under pressure again if the risk aversion sentiment rises again in the future. In addition, the current minimum yield on Bloomberg Barclays Emerging Market investment-grade bonds is 5.46%. Compared to the yield of 5.35% on US corporate investment-grade bonds, the yield advantages is not evident. Hence, investors shall still bide their time for potential investment opportunities in emerging bond markets.  \ninformation contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "9b634ba013ac46419859c1ef92e39942",
    "heading": "Commodities",
    "tokens": 348,
    "text": "Fig. 7 and Fig. 8: Commodity Prices (as of April 30, 2025) Source: Wind, BOC Investment Strategy Research Center Source: Wind, BOC Investment Strategy Research Center Gold: The risk aversion sentiment has eased, and gold prices are expected to fluctuate at highs, whereas the long-term trend of upward movements has yet to change In May, the gold market showed a trend of “rises prior to declines”. During the early stage, the market’s risk aversion sentiment supported the rise in gold prices. Nevertheless, the global trade tension eased, and the risk aversion sentiment has cooled. Moreover, the USD index rose, and US stocks and other risk assets rebounded sharply. US bond yields rebounded, and the RMB appreciated, whereas the price of gold as safe-haven assets fell from a high level amid the resonance of multiple negative factors. Looking forward to June, the market is expected to resume the risk appetite sentiment in the short term. Due to concerns about the impact of the trade policy on the US economy, the market originally expected the Fed to restart monetary easing in June. Against the backdrop of the easing of the trade tension, the pressure to cut interest rates was temporarily eased, and the expectations of two rate cuts were maintained before the end of the year. In the near term, gold prices are subject to adjustments under pressure. Since May, the investors’ buying intentions have weakened near historical highs. Nevertheless, in the mid-to long-term, the gold market is likely to remain bullish in the long run due to factors including the rate cuts by global central banks, risk aversion and gold purchases by central banks. The easing of global trade tension has imposed certain"
  },
  {
    "id": "65f5d4ae38ee470cb91cd2e42c70a036",
    "heading": "Commodities",
    "tokens": 456,
    "text": "backdrop of the easing of the trade tension, the pressure to cut interest rates was temporarily eased, and the expectations of two rate cuts were maintained before the end of the year. In the near term, gold prices are subject to adjustments under pressure. Since May, the investors’ buying intentions have weakened near historical highs. Nevertheless, in the mid-to long-term, the gold market is likely to remain bullish in the long run due to factors including the rate cuts by global central banks, risk aversion and gold purchases by central banks. The easing of global trade tension has imposed certain pressure on gold prices, but the pullback in gold prices has also attracted a lot of bargain buying. As of April, the PBOC has increased its holdings of gold for six consecutive months. In addition, the imminent start of demand for the wedding season in India is expected to drive physical gold purchases, which will support gold prices. At present, the international gold price is fluctuating amid consolidation, and after the break, it may still consistently rise if it could effectively break through the range of oscillations upward. Ina nutshell, the trend of gold market is still dominated by safe-haven demands, the movements of the USD, and the Fed’s policy. In the mid-to long-term, the difference in the expectations of interest rate cuts may lead to a short-term adjustments in gold prices, but the upward trend remains unchanged in the long run. Moreover, investors need to continue to pay closer attention to the progress of the trade news, the Fed’s interest rate decisions and the dynamics of gold purchases by central banks. In the short-term, the RMB is in the stage of appreciation. Amid corrections of gold prices, investors may arrange gold purchases in batches at a relatively low price. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Crude oil: Oil prices are expected to experience a rebound amid restoration as driven by demands In May 2025, oil prices stabilized amid a rebound with a weak pattern. First, the necessity of the oil-producing countries to further accelerate production may be weakened. Second, trade talks have achieved progress."
  },
  {
    "id": "4d6ba4525d1a4fbc90fba6ddf476d32a",
    "heading": "Commodities",
    "tokens": 260,
    "text": "information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. Crude oil: Oil prices are expected to experience a rebound amid restoration as driven by demands In May 2025, oil prices stabilized amid a rebound with a weak pattern. First, the necessity of the oil-producing countries to further accelerate production may be weakened. Second, trade talks have achieved progress. Looking forward to June 2025, crude oil prices are driven by demands and are expected to be restored. On the demand side, China’s trade data in April saw supportive signs, with the growth of exports exceeding the market’s expectations and the declines of imports narrowing. Despite declines in crude imports from March, they still rose by 7.5% year-over-year, thanks to the replenishment of inventories by state-owned refineries during plant maintenance. These data suggest that demands continued to be resilient, which could stabilize short-term expectations of oil prices as concerns over global demands persist. At the same time, the EIA raised its forecast for global crude oil demands in 2025, expecting global oil demands to reach 103.7 million bpd in 2025, compared with the"
  },
  {
    "id": "00f98221c55c425caade1463444d43d8",
    "heading": "Commodities",
    "tokens": 393,
    "text": "trade data in April saw supportive signs, with the growth of exports exceeding the market’s expectations and the declines of imports narrowing. Despite declines in crude imports from March, they still rose by 7.5% year-over-year, thanks to the replenishment of inventories by state-owned refineries during plant maintenance. These data suggest that demands continued to be resilient, which could stabilize short-term expectations of oil prices as concerns over global demands persist. At the same time, the EIA raised its forecast for global crude oil demands in 2025, expecting global oil demands to reach 103.7 million bpd in 2025, compared with the previous forecast of 103.6 million bpd. On the supply side, numerous factors are still likely to limit the rise in oil prices. The OPEC bloc continued to signal increased production. However, some oil-producing countries’ actual production declined, offsetting planned increases in other regions. The mixed situation of the OPEC+ alliance has provided support for oil prices at bottom in the near term, especially as demand-side confidence continued to grow. However, due to the Trump administration’s policy, immigration control and other measures, the inflation is likely to rise in H2, 2025, further posing constraints to the Fed’s room of lowering interest rates. The Fed’s “hawkish” stance overall has led to a general reduction in the expectations of interest rate cuts, and the USD index is expected to remain strong, suppressing oil prices. Overall, the oil market has shifted from “unilateral pessimism” to “cautious optimism’, but the recurrence of policies and uncertainties suggests that volatility is likely to climb, and oil prices are expected to experience a rebound amid restoration as driven by demands. The information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "af01f5908c834fa09f5e338015ff216a",
    "heading": "Foreign Exchange",
    "tokens": 431,
    "text": "Fig. 9 and Fig. 10: Foreign Exchange Prices (as of April 30, 2025) Source: Wind, BOC Investment Strategy Research Center US. dollar: USD is expected to temporarily stabilize in the short term Affected by the US trade policy, the USD index fell and remained below the level of 100 in early May until the FOMC meeting in May was concluded and the Joint Statement on China-US Economic and Trade Meeting in Geneva was released. In particular, the market optimism supported the rebound of the USD index to the level of 102, close to the 50-day moving average. At the FOMC meeting in May, the Fed signaled that the risks of rising inflation and unemployment in the US had intensified, but it would not be in a hurry to cut interest rates based on the current solid labor market. This is due to the need for the Fed to balance the underlying inflation that may further rise and the likelihood of a downturn in the economy. Judging from the remarks of the chairman of the Fed, the central bank is still vigilant about the trend of inflation, and tends to maintain the current level of interest rates to control the risks of a sharp rise in inflation before the economy slows down evidently. Unless there are signs of weakening of the US economy, the Fed may not consider accelerating the interest rate cuts. The cooling of the expectations of interest rate cuts is likely to support the USD’s advantages in terms of interest rate gap. Nevertheless, against the backdrop of policy uncertainties, it is expected that the market still needs to observe a clearer policy direction to support the USD’s upward trend, and the expectations may continue to fluctuate under the influence of either positive or negative news. Euro: EUR is constrained by economic prospects on the downside, and monetary policies on the upside, and is likely to remain volatile at highs Driven by the declines in the USD index, the EUR briefly rose to a record high since 2021 in April and has since retreated. Compared with the US, the market is less concerned about the Eurozone economy, and varying officials of the ECB have expressed that although the economy is"
  },
  {
    "id": "6329e2852fe14c47baba3bd20892463e",
    "heading": "Foreign Exchange",
    "tokens": 271,
    "text": "a clearer policy direction to support the USD’s upward trend, and the expectations may continue to fluctuate under the influence of either positive or negative news. Euro: EUR is constrained by economic prospects on the downside, and monetary policies on the upside, and is likely to remain volatile at highs Driven by the declines in the USD index, the EUR briefly rose to a record high since 2021 in April and has since retreated. Compared with the US, the market is less concerned about the Eurozone economy, and varying officials of the ECB have expressed that although the economy is slowing, there is a relative low chance for the Eurozone economy to experience a recession due to the trade environment. At the same time, inflation in Europe at the production and consumer levels is expected to fall back to the target level of 2% in a sustained and stable manner, thus supporting the ECB to consistently cut interest rates to bolster the economy. According to the interest rate futures market, the ECB still has a chance of over 80% to lower interest rates again at its policy meeting in June. While lower interest rates may reduce the attractiveness of the EUR, a relatively positive economic outlook is likely to limit the EUR’s downside movements. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any"
  },
  {
    "id": "dc8fffc897724903bba1efc0f3fd9f89",
    "heading": "Foreign Exchange",
    "tokens": 401,
    "text": "fall back to the target level of 2% in a sustained and stable manner, thus supporting the ECB to consistently cut interest rates to bolster the economy. According to the interest rate futures market, the ECB still has a chance of over 80% to lower interest rates again at its policy meeting in June. While lower interest rates may reduce the attractiveness of the EUR, a relatively positive economic outlook is likely to limit the EUR’s downside movements. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details. British pound: GBP’s movements are exposed to slowdown of economic growth, shift towards dovish policy and outflow of capital Since President Trump announced different policies in April, the GBP has rallied versus the USD but underperformed against half of the other G10 currencies. Despite apparent attempts by the White House to de-escalate situation, uncertainty remains elevated. Such uncertainty has caused currency markets to break from their usual relationship with interest rate differentials. In the clearest display on both ends of the spectrum, US political uncertainty has made GBP a safer haven than the USD (GBP strengthen against USD), but it remains riskier than the EUR (GBP weakens against EUR). The UK’s current account deficit leaves GBP vulnerable to sudden shifts in investor sentiment. In contrast, Eurozone runs a large current account surplus, generating an excess of capital that is invested in overseas markets. But in times of financial market stress, de-risking can cause capital repatriation supporting the EUR. GBP has often exhibited a negative correlation to gilt yields during a market fall, suggesting some fiscal risk premium remains. While sticky services inflation could keep the Bank of England patient, headwinds are starting to emerge for the currency. Japanese yen: JPY is influenced by the temporary easing of market risk appetites, and closer attention shall be paid to subsequent trade development between the US and Japan"
  },
  {
    "id": "3e016fcd6fc04aa9a99c753fc6296923",
    "heading": "Foreign Exchange",
    "tokens": 230,
    "text": "Japanese yen: JPY is influenced by the temporary easing of market risk appetites, and closer attention shall be paid to subsequent trade development between the US and Japan  \nDue to the Trump administration’s policies, the USD index has retreated against major currencies across the board, including the USD/JPY, which slipped to around 145 from around 150 in early April. There seem to be signs of pause in the recent trend of de- dollarization in the market, with the USD index and long-term US Treasury prices stabilizing. In June, the USD will remain the key to determining the orientation of the movements of the USD/JPY. From a statistical perspective, the data released by the Japanese government showed that household spending increased by 2.1% year-over-year and 0.4% month-over-month in March, both exceeding the market’s expectations, reflecting a gradual recovery in consumption. Although real wages fell for the third consecutive month (by 2.1% in March), the market’s expectations remain that the trend of wage increases and high inflation will prompt the BoJ to hike interest rates further in 2025."
  },
  {
    "id": "b57d4f8ae58f4b0b8ee0816041348696",
    "heading": "Commodity currencies:",
    "tokens": 300,
    "text": "Canadian dollar: CAD is likely to oscillate within a range amid a rather weak pattern The Canadian GDP growth rate in Feb, 2025 reached merely 1.6% year-over-year, and retail sales fell by 0.4% month-over-month in Feb. Domestic demands remained insufficient, and the unemployment rate rose to 6.9% in Apr. With respect to the crude oil, the resumption of summer production activities in Canada’s major crude producing areas were positive for the CAD’s movements. Nevertheless, oil prices are likely to fluctuate at highs due to the easing of geopolitical factor. Australian dollar: AUD is expected to oscillate with a rather bullish pattern, and attention shall be paid to key support levels The Australian CPI rose to 2.4% year-over-year in Q1, 2025, the core inflation also rose to 2.9% year-over year, both higher than market expectations, increasing the market’s expectations that the RBA would keep interest rates unchanged. Coupled with the substantial progress made in China and US joint statement, China’s stimulus policies have been moderately implemented, further supporting the AUD. Moving forward, closer attention shall be paid to the key data of US CPI and the orientation of the Fed’s monetary policy decision. Renminbi: RMB is likely to remain basically stable at a reasonable and balanced level As of May 12, the CFETS USD/RMB exchange rate closed at 7.2132, hitting a new"
  },
  {
    "id": "3aa78c8a14084bb780f43c0a2c0ddd0c",
    "heading": "Commodity currencies:",
    "tokens": 414,
    "text": "core inflation also rose to 2.9% year-over year, both higher than market expectations, increasing the market’s expectations that the RBA would keep interest rates unchanged. Coupled with the substantial progress made in China and US joint statement, China’s stimulus policies have been moderately implemented, further supporting the AUD. Moving forward, closer attention shall be paid to the key data of US CPI and the orientation of the Fed’s monetary policy decision. Renminbi: RMB is likely to remain basically stable at a reasonable and balanced level As of May 12, the CFETS USD/RMB exchange rate closed at 7.2132, hitting a new high for the year, and as of May 9, the RMB exchange rate index closed at 96.53, a slight increase of 0.34% from the previous month. China and the US issued joint statement, the market’s risk appetites have eased, and the USD/RMB has experienced a rebound. However, the progress of subsequent news will continue to disrupt the foreign exchange market. In addition to trade policy variables, the Fed kept its policy unchanged in May, and the PBOC cut interest rates on central bank lending by 0.25 percentage points for structural monetary policy tools and 0.1 percentage points for the policy rate, and the interest rate spread advantages were still in favor of the USD. With respect to imports and exports, the overall export was still better than expected in April, thus bolstering the RMB exchange rate. As stated in the PBOC’s monetary policy implementation report for Q1, 2025, the RMB exchange rate will remain basically stable at a reasonable and balanced level. As such, there is a low chance for RMB assets to experience substantial volatility, and the RMB is expected to consistently operate within a reasonable range. information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "7888fbb997a44e908830ed7f63858db8",
    "heading": "Asset Allocation",
    "tokens": 86,
    "text": "Fig. 11: Overview of Global Asset Allocation Perspectives for 2025  \nSource: BOC Investment Strategy Research Center  \nNotes: The black dots represent annual opinions, and the red dots represent revised opinions for Q2.  \ninformation contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "4f93a198fd894d2aaa3da9289c6dc297",
    "heading": "Opportunities and risks of investors’ asset allocation in Q2.",
    "tokens": 308,
    "text": "In general, Q2 is likely to be a period of multi-party development. Global trade development, economic growth and sustainable development will be subject to multi impact, and the impact is expected to reach the maximum extent in Q2, 2025. The direct consequence of rising uncertainties within the market is the increase in global asset volatility. Except for gold, which has a strong function of hedging volatility, the timing of the conversion between risks and opportunities of other asset categories may be difficult to grasp. With respect to opportunities, every cloud has a silver lining. First, gold is the most certain opportunity among major asset categories. This is the common belief of global funds for “establishing the new before abolishing the old” international economic order. Second, at a certain moment, risk assets are mixed with turbulence, and there is an opportunity for mean reversion brought about by overreaction. It is foreseeable that the fluctuation in US stocks will be transmitted to Internet stocks of Chinese concept shares, and then drag down the irrational and sharp declines of the Hang Seng TECH Index. We tend to focus on the opportunities brought by the oversold Chinese equity assets, including the STAR board and the Hang Seng TECH Index, as well as the opportunities of asset allocation into the oversold US stocks. Third, closer attention shall be paid to the opportunities brought by the development of US policies and the adjustments of the Fed’s policies. Furthermore, it may be too early for opportunities of “establishing the new before abolishing the old” international economic"
  },
  {
    "id": "9a7f5562c7aa409ba69f10fe9b0e3ae2",
    "heading": "Opportunities and risks of investors’ asset allocation in Q2.",
    "tokens": 482,
    "text": "to Internet stocks of Chinese concept shares, and then drag down the irrational and sharp declines of the Hang Seng TECH Index. We tend to focus on the opportunities brought by the oversold Chinese equity assets, including the STAR board and the Hang Seng TECH Index, as well as the opportunities of asset allocation into the oversold US stocks. Third, closer attention shall be paid to the opportunities brought by the development of US policies and the adjustments of the Fed’s policies. Furthermore, it may be too early for opportunities of “establishing the new before abolishing the old” international economic order to arise in Q2, but once the trend is initiated, the capital market will definitely react in advance, thus providing opportunities of investments. With respect to risks, closer attention shall be paid to the risks after substantial adjustments. The market atmosphere in Q2 must be filled with the coexistence of bad news and good news of policy hedging. The mix of information, requires investors to have a vision in investment and maintain composure. It is recommended to adhere to the principles of asset allocation, while adapting to changes by remaining unchanged. Moreover, investors shall refrain from massive selling after a big drop. The risks that need to pay attention to do not mean they will inevitably occur, but responsive measures shall be taken in the portfolios of asset allocation. Managing Editor: Yan Ye Editor-in-chief: Qu Gang, Wen Xiaobo Global Economy: Zhu Qibing, Lee John, Choy Tsun Sang Johnson, Yingdi Liu Tina, Chang Ke Stock Market: Cheung Sze Kei, Wang Jun, Yu Chao, Yingdi Liu Tina, Zhao Yuan Bond Market: Hong Zhengchong, Hung Kwan Ching, Wan Jie, Wong Po Kwan, Sun Zhiyong, Tong Yu Commodities: Wu Xia, Zhao Xinran, Yan Wenhui Foreign Exchange: Cheung Sze Kei, Kai Lim, Ding Meng, Pan Jianfeng, Liu Chang, Song Huili Editors: Li Pinzhang, Su Kangmiao, Chang Ke, Yu Chao, Hong Zhengchong, Liu Chang, Wu Xia Consultants: Xu Gao, Guan Tao The information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  },
  {
    "id": "2fffbc3ec10c46cb833e0ea1656a7d5d",
    "heading": "Risk Disclosure",
    "tokens": 503,
    "text": "4lnvestment involves risks. It is as likely that losses will be incurred rather than profit made as a result of buying and selling securities, commodities, foreign exchanges, derivatives or other investments. The price of a security may move up or down, and may become valueless. Past performance is not necessarily indicative of future performance. Foreign investments carry additional risks not generally associated with investments in the domestic market, including but not limited to adverse changes in currency rate, foreign laws and regulations (e.g. foreign exchange control). This document does not and is not intended to cover any or all of the risks that may be involved in the securities or investments referred to herein. Investors should read and fully understand all the offering documents relating to such securities or investments and all the risk disclosure statements and risk warnings therein before making any investment decisions.  \n4Risk Disclosure of Foreign Currency Trading: Foreign currencies/ RMB products are subject to exchange rate fluctuations which may provide both opportunities and risks. The fluctuation in the exchange rate of foreign currencies/ RMB may result in losses in the event that the customer converts the foreign currencies/ RMB fund into Hong Kong dollar or other foreign currencies.  \n4Risk Disclosure of RMB Conversion Limitation Risk: RMB investments are subject to exchange rate fluctuations which may provide both opportunities and risks. The fluctuation in the exchange rate of RMB may result in losses in the event that the customer converts RMB into HKD or other foreign currencies.  \n4(Only applicable to Individual Customers) RMB is currently not fully freely convertible. Individual customers can be offered CNH rate to conduct conversion of RMB through bank accounts and may occasionally not be able to do so fully or immediately, for which it is subject to the RMB position of the banks and their commercial decisions at that moment. Customers should consider and understand the possible impact on their liquidity of RMB funds in advance.  \n4(Only applicable to Corporate Customers) RMB is currently not fully freely convertible. Corporate customers that intend to conduct conversion of RMB through banks may occasionally not be able to do so fully or immediately, for which it is subject to the RMB position of the banks and their commercial decisions at that moment. Customers should consider and understand the possible impact on their liquidity of RMB funds in advance.  \nThe information contained in this document is for reference only and does not constitute any offer, solicitation, recommendation, advice or guarantee, for any investment products or services. Please refer to the disclaimer for details."
  }
]